# SpacingNumDivisionsU Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpacingNumDivisionsU Property
ParameterTypeId Class See Also
---
"Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpacingNumDivisionsU { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpacingNumDivisionsU As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpacingNumDivisionsU {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace